Repository: CDLUC3/dmptool_late_2019
Catalog: config/locale/*/app.po
Languages: fi

source: The information user enter into this system can be seen by the User, people User have chosen to share access with, and - solely for the purposes of maintaining the service - system administrators at the University of Edinburgh and Helsinki University Library. Admistrators compile anonymised, automated and aggregated information from plans, but they will not directly access, make use of, or share content created by User with anyone else without users' permission.
fi: Käyttäjä, jonka käyttäjät ovat päässeet tähän järjestelmään, voi nähdä Käyttäjän, jonka käyttäjä on päättänyt jakaa käyttöoikeudet, ja - yksinomaan Edinburghin yliopiston ja Helsingin yliopiston kirjaston palvelujärjestelmän ylläpitäjien ylläpitämiseksi. Hallinnoijat kokoavat anonyymiä, automatisoituja ja yhdistettyjä tietoja suunnitelmista, mutta he eivät suoraan pääse käyttämään, käyttämään tai jakamaan käyttäjän luomaa sisältöä kenellekään muulle ilman käyttäjän lupaa.

source: Authorised officers of user's home institution may access the metadata of data management plans or user information. Metadata includes: Plan name, ID, Grant number, Principal Investigator/Researcher, Principal Investigator/Researcher ID, Plan data contact, Description, email.
fi: Käyttäjäkeskuksen valtuutetut virkailijat saattavat käyttää tietojenhallintasuunnitelmien tai käyttäjätietojen metatietoja. Metatietoihin kuuluvat: Suunnitelma, tunnus, rahoitustunnus, johtava tutkija / tutkija, johtava tutkija / tutkijan tunnus, suunnitelma yhteystiedot, kuvaus, sähköposti.

source: Contents of the data register
fi: Tietorekisterin sisältö

source: User gives during registration information about:
fi: Käyttäjä antaa rekisteröinnin aikana tietoja:

source: Organisation
fi: Organisaatio

source: First name
fi: Etunimi

source: Last name
fi: Sukunimi

source: ORCID number
fi: ORCID-numero

source: User gives by creating a DMP information about:
fi: Käyttäjä antaa luomalla DMP-tiedot:

source: Grant number
fi: Hakemuksen numero

source: Principal Investigator/Researcher
fi: Vastuullinen tutkija / tutkija

source: Principal Investigator/Researcher ID
fi: Vastuullinen tutkija / tutkija-tunnus

source: Plan data contact
fi: Suunnittele yhteystieto

source: Data management plan
fi: Tietojenhallintasuunnitelma

source: Regular sources of information
fi: Säännölliset tietolähteet

source: The data will be generated by the users.
fi: Käyttäjät tuottavat tietoja.

source: Disclosure of personal data
fi: Henkilötietojen julkistaminen

source: We will not sell, rent, or trade any personal information you provide to us.
fi: Emme myy, vuokraa tai käy kauppaa meille antamiasi henkilötietoja.

source: The principles of data protection
fi: Tietosuojan periaatteet

source: Data transmitted along information networks are encrypted by means of SSL technology. A register generated from data of Users and data management plans for a server is thereby protected.
fi: Tietoverkkojen kautta lähetetyt tiedot salataan SSL-tekniikalla. Palvelimelta peräisin olevien käyttäjien ja tietosuojasuunnitelmien dataa tuottava rekisteri on näin ollen suojattu.

source: The passwords are stored in encrypted form and cannot be retrieved. If forgotten it has to be reset.
fi: Salasanat tallennetaan salatussa muodossa, eikä niitä voi hakea. Jos se unohtuu, se täytyy nollata.

source: Right of access by the data subject
fi: Rekisteröidyn käyttöoikeus

source: The personal data is managed by the user (data subject). Therefore they have full access to their own personal data at any point of time. We will hold the personal data you provided us for as long as you continue using the %{application_name} service. Your personal data can be removed from this service upon request to the %{application_name} team within a period of 30 days.
fi: Henkilötietoja hallinnoi käyttäjä (tieto). Siksi heillä on täysi pääsy omiin henkilötietoihinsä milloin tahansa. Pidämme antamiasi henkilötietoja niin kauan kuin käytät edelleen %{application_name} -palvelua. Henkilökohtaiset tiedot voidaan poistaa tästä palvelusta pyynnöstä %{application_name} -tiimiin 30 päivän kuluessa.

source: Right to lodge a complaint with a supervisory authority
fi: Oikeus esittää kantelu valvontaviranomaiselle

source: The personal data is managed by the user (data subject). The system administrator will manage personal data of the user only based on request from the user.
fi: Henkilötietoja hallinnoi käyttäjä (tieto). Järjestelmänvalvoja hallinnoi käyttäjän henkilökohtaisia ​​tietoja vain käyttäjän pyynnöstä.
