Repository: CDLUC3/dmptool_late_2019
Catalog: config/locale/*/app.po
Languages: fi

source: Name
fi: Nimi

source: Email
fi: Sähköposti

source: Subject
fi: Aihe

source: Message
fi: Viesti

source: Security check
fi: Turvallisuustarkistus

source: Submit
fi: Lähetä

source: Contact Us
fi: Ota yhteyttä

source: %{application_name} is provided by the %{organisation_name}.<br /> You can find out more about us on our <a href="%{organisation_url}" target="_blank">website</a>. If you would like to contact us about %{application_name}, please fill out the form below.
fi: %{application_name} tarjoaa %{organisation_name}. <br /> Voit lukea lisää meistä <a href="%{organisation_url}" target="_blank">verkkosivuillamme</a> . Jos haluat ottaa meihin yhteyttä %{application_name}, täytä alla oleva lomake.

source: %{application_name} is based on DMPonline code and delivered by the UK\'s <a href=\'https://dcc.ac.uk/\'>Digital Curation Centre</a>.
fi: %{application_name} perustuu DMPonline-koodiin ja toimittaa Yhdistyneen kuningaskunnan <a href=\'https://dcc.ac.uk/\'>Digital Curation Center</a> .

source: Welcome
fi: Tervetuloa

source: Data management planning tool %{application_name} helps you to create, review, and share data management plans that meet institutional and funder requirements.
fi: Tietojenhallinnan suunnittelutyökalu %{application_name} auttaa luomaan, tarkastelemaan ja jakamaan tietojärjestelmää, joka täyttää institutionaaliset ja rahoittajien vaatimukset.

source: Join the growing number of researchers that have adopted DMPTuuli:
fi: Liity kasvaviin tutkijoihin, jotka ovat ottaneet DMPTuulit käyttöön:

source: %{num_users} Users
fi: %{num_users} Käyttäjät

source: %{num_plans} Plans
fi: %{num_plans} suunnitelmat

source: %{num_orgs} Organisations
fi: %{num_orgs} -organisaatiot

source: You can download funder templates without logging in, but from DMPTuuli you will find tailored guidance from many research organisations, including universities and service providers like the Finnish Social Science Data Archive. Why not sign up for an account and try it out?
fi: Voit ladata rahoittajamallit kirjautumatta sisään, mutta DMPTuulista löydät räätälöityjä ohjeita monilta tutkimusorganisaatioilta, kuten yliopistoilta ja palveluntarjoajilta, kuten yhteiskuntatieteellisen tiedon arkistosta. Miksi et voi kirjautua tiliin ja kokeilla sitä?

source: Admin
fi: Ylläpitäjä

source: Plans
fi: Suunnitelmaa

source: Templates
fi: Mallipohjat

source: Guidance
fi: Ohjeistus

source: Organisations
fi: Organisaatiota

source: Organisation details
fi: Organisaation tiedot

source: Users
fi: Käyttäjää

source: Themes
fi: Teemat

source: Usage
fi: Tilastot

source: Based on work by the Digital Curation Centre
fi: Perustuu Digital Curation Centerin töihin

source: About
fi: Tietoa

source: Contact us
fi: Ota yhteyttä

source: Privacy policy
fi: Tietosuojakäytäntö

source: Delivered by DCC
fi: Toimittaa DCC

source: My Dashboard
fi: Ohjausnäkymä

source: Create plans
fi: Luo suunnitelmia

source: Reference
fi: Julkiset DMP:t

source: Public DMPs
fi: Julkiset aineistonhallintasuunnitelmat

source: Public DMP templates
fi: Julkiset DMP-malleja

source: Home
fi: Etusivu

source: Help
fi: Ohje

source: Sign in
fi: Kirjaudu sisään

source: Templates for data management plans are based on the specific requirements listed in funder policy documents. DMPTuuli maintains these templates, however, researchers should always consult the funder guidelines directly for authoritative information.
fi: Tietojenhallintasuunnitelmien mallit perustuvat rahoittajapoliittisiin asiakirjoihin sisältyviin erityisiin vaatimuksiin. DMPTuuli ylläpitää näitä mallipohjia, mutta tutkijoiden tulee aina kysyä rahoittajien ohjeita suoraan arvovaltaisista tiedoista.

source: There are currently no public Templates.
fi: Tällä hetkellä ei ole yhtään julkista mallipohjaa.

source: Password
fi: Salasana

source: Forgot password?
fi: Unohditko salasanasi?

source: or
fi: tai

source: Sign in with institutional credentials (HAKA only)
fi: Kirjaudu sisään institutionaalisilla valtakirjoilla (vain HAKA)

source: About %{application_name}
fi: Tietoa %{application_name} -työkalusta

source: Data management plan (DMP) will help you manage your data, meet funder requirements and help others use your data if shared. %{application_name} will help you write data management plans.
fi: Tietojenhallintasuunnitelma (DMP) auttaa sinua hallitsemaan tietojasi, vastaamaan rahoittajien vaatimuksia ja auttamaan muita käyttäjiäsi tietoja, jos niitä jaetaan. %{application_name} auttaa kirjoittamaan tietosuojasuunnitelmia.

source: %{application_name} is provided by the Finnish <a href=\'https://wiki.helsinki.fi/display/Tuuli/Tuuli-projekti\'>Tuuli project</a>.The project has worked closely with researchers and research funders to produce guidance and templates that assist researchers to produce an effective data management plan (DMP) to cater for the whole lifecycle of a project, from bid-preparation stage through to completion.
fi: %{application_name} tarjoaa suomalainen <a href=\'https://wiki.helsinki.fi/display/Tuuli/Tuuli-projekti\'>Tuuli-hanke</a> . Projekti on tehnyt tiivistä yhteistyötä tutkijoiden ja tutkimusrahoittajien kanssa tuottamaan ohjeita ja malleja, jotka auttavat tutkijoita tuottamaan tehokkaan tietosuojasuunnitelman (DMP) hankkeen koko elinkaaren ajan tarjousvalmisteluvaihe loppuun saakka.

source: %{application_name} is based on <a href=\'https://dmponline.dcc.ac.uk/\'>DMPonline</a> code, developed by the UK\'s <a href=\'https://dcc.ac.uk/\'>Digital Curation Centre</a>.
fi: %{application_name} perustuu <a href=\'https://dmponline.dcc.ac.uk/\'>DMPonline-</a> koodiin, jonka on kehittänyt UK <a href=\'https://dcc.ac.uk/\'>Digital Curation Center</a> .

source: How the tool works
fi: Miten työkalu toimii?

source: There are a number of templates within the tool that represent the requirements of different funders and institutions. Users are asked three questions at the outset so we can determine the appropriate template to display. Guidance is provided to help you interpret and answer the questions. This guidance is provided by researcher funders, universities and disciplines.
fi: Työkalussa on useita malleja, jotka edustavat eri rahoittajien ja laitosten vaatimuksia. Käyttäjiä kysytään aluksi kolme kysymystä, jotta voimme määrittää sopivan mallin näytettäväksi. Ohjaus auttaa sinua tulkitsemaan ja vastaamaan kysymyksiin. Opastusta antavat tutkijoiden rahoittajat, yliopistot ja tieteenalat.

source: Getting Started
fi: Näin pääset alkuun

source: If you have an account please sign in and start creating or editing your DMP.
fi: Jos sinulla on jo tili, voit kirjautua sisään ja aloittaa uuden aineistonhallintasuunnitelman kirjoittamisen tai vanhan muokkaamisen.

source: If you do not have a %{application_name} account, click on <a href=\'/\'>\'Create account\'</a> on the homepage.
fi: Jos sinulla ei ole %{application_name} -tiliä, napsauta <a href=\'/\'>\ 'Luo tili \ "</a> etusivulla.

source: Please visit the <a href=\'/help\'>\'Help\'</a> page for guidance.
fi: Käy ohjeiden <a href=\'/help\'>\ 'Ohje \ "</a> -sivulla.

source: Additional Information
fi: Lisätietoja

source: We are constantly improving the user interface and functionality of %{application_name}. If you would like to contribute with feedback and suggestions, please contact us by emailing <a href=\'mailto:%{application_email}?Subject=%{application_name} inquiry' target='_top'>%{application_email}</a>.
fi: Parannamme jatkuvasti %{application_name}: n käyttöliittymää ja toimintoja. Jos haluat antaa palautetta ja ehdotuksia, ota meihin yhteyttä lähettämällä sähköpostia <a href=\'mailto:%{application_email}?Subject=%{application_name} inquiry' target='_top'>%{application_email}</a> .

source: On data management planning
fi: Tietojenhallinnan suunnittelussa

source: Screencast on How to Use DMPTuuli
fi: Screencast, miten käyttää DMPTuulia

source: When you log in to DMPTuuli you will be directed to the 'My Dashboard' page. From here you can edit, share, download, copy or remove any of your plans. You will also see plans that have been shared with you by others.
fi: Kun kirjaudut sisään DMPTuuliin, sinut ohjataan "Oma kojelauta" -sivulle. Tästä voit muokata, jakaa, ladata, kopioida tai poistaa suunnitelmasi. Näet myös suunnitelmia, jotka on jaettu muiden kanssa.

source: Create a plan
fi: Luo suunnitelma

source: To create a plan, click the 'Create plan' button from the 'My Dashboard' page or the top menu. Select options from the menus and tickboxes to determine what questions and guidance you should be presented with. Confirm your selection by clicking 'Create plan.'
fi: Kun aloitat uuden suunnitelman luomisen, klikkaa Luo suunnitelma –painiketta ohjausnäkymä –välilehdellä tai ylävalikossa. Valitse pudotusvalikosta rahoittaja ja organisaatio, jonka kysymyksiä ja ohjeita haluat noudattaa suunnitelman kirjoittamisessa. Vahvista valinnat klikkaamalla Luo suunnitelma –painiketta.

source: Write your plan
fi: Kirjoita suunnitelmaa

source: The tabbed interface allows you to navigate through different functions when editing your plan.
fi: Työkalussa on useita välilehtiä.

source: 'Project Details' includes basic administrative details.
fi: Tutkimusprojekti -välilehdellä on hallinnollisia yleistietoja suunnitelmastasi.

source: Plan Overview’ tells you what template and guidance your plan is based on and gives you an overview to the questions that you will be asked.
fi: Suunnittelun yleiskatsaus "kertoo, mihin malliin ja ohjelmiin pohjautuu, ja antaa sinulle yleiskatsauksen kysymyksiin, joista sinua pyydetään.

source: The following tab(s) present the questions to answer. There may be more than one tab if your funder or university asks different sets of questions at different stages e.g. at grant application and post-award.
fi: Seuraava välilehti sisältää kysymyksiä, joihin aineistonhallintasuunnitelmassa halutaan vastaus. Välilehtiä voi olla useampiakin, jos rahoittaja tai organisaatio edellyttää eri tietoja rahoitushakemuksen eri vaiheissa.

source: 'Share' allows you to invite others to read or contribute to your plan.
fi: Jaa-välilehdellä voit jakaa muille luku- tai muokkausoikeuksia suunnitelmaasi.

source: 'Download' allows you to download your plan in various formats. This may be useful if you need to submit your plan as part of a grant application.
fi: Tulostus-välilehdellä voit ladata suunnitelmasi monissa eri tiedostomuodoissa. Tästä toiminnosta on hyötyä, jos rahoittajasi vaatii suunnitelman liittämistä rahoitushakemukseen.

source: When viewing any of the question tabs, you will see the different sections of your plan displayed. Click into these in turn to answer the questions. You can format your responses using the text editing buttons.
fi: Klikkaamalla otsikoita saat näkyviin suunnitelman eri osiot. Pääset kirjoittamaan vastauksesi klikkaamalla osion otsikkoa. Vastauksia voi muokata tekstinmuokkaustyökaluilla.

source: Guidance is displayed in the right-hand panel. If you need more guidance or find there is too much, you can make adjustments on the ‘Project Details’ tab.
fi: Suunnitelman ohjeistus näkyy oikeassa reunassa klikkaamalla +-merkkiä. Ohjeiden näkymistä voi muokata ‘Tutkimusprojekti’-välilehdellä.

source: Share plans
fi: Suunnitelmien jakaminen

source: Insert the email address of any collaborators you would like to invite to read or edit your plan. Set the level of permissions you would like to grant them via the radio buttons and click to 'Add collaborator.' Adjust permissions or remove collaborators at any time via the drop-down options.
fi: Lisää tekstikenttään niiden henkilöiden sähköpostiosoitteet, joille haluat jakaa suunnitelmasi ja lähetä kutsu klikkaamalla Lähetä-painiketta. Määrittele heidän käyttöoikeutensa valintanapeilla, ja voit myös milloin tahansa muokata käyttöoikeuksia tai poistaa niitä pudotusvalikosta.

source: The ‘Share’ tab is also where you can set your plan visibility.
fi: Jaa-välilehdellä voit myös määrittää suunnitelmasi näkyvyyden.

source: Private: restricted to you and your collaborators.
fi: Yksityinen: rajattu minulle ja yhteistyökumppaneilleni

source: Organisational: anyone at your organisation can view your plan.
fi: Organisaatiokohtainen: kuka tahansa organisaatiossasi voi tarkastella suunnitelmaasi.

source: Public: anyone can view your plan in the Public DMPs list.
fi: Julkinen: kuka tahansa voi nähdä suunnitelmasi Julkiset suunnitelmat -listalla.

source: By default all new and test plans will be set to ‘Private’ visibility. ‘Public’ and ‘Organisational’ visibility are intended for finished plans. You must answer at least 50&#37; of the questions to enable these options.
fi: Oletuksena kaikki uudet ja testaussuunnitelmat asetetaan "Yksityisiksi" näkyviksi. Julkinen ja organisatorinen näkyvyys on tarkoitettu valmiisiin suunnitelmiin. Sinun on vastattava vähintään 50 & # 37; kysymyksiä näiden vaihtoehtojen mahdollistamiseksi.

source: Request feedback
fi: Pyydä palautetta

source: There may also be an option to request feedback on your plan. This is available when research support staff at your organisation have enabled this service. Click to ‘Request feedback’ and your local administrators will be alerted to your request. Their comments will be visible in the ‘Comments’ field adjacent to each question. You will be notified by email when an administrator provides feedback.
fi: Myös palautteen pyytäminen suunnitelmasta on mahdollista, jos tutkimuksen tukipalvelut ovat ottaneet tämän palvelun käyttöön. Klikkaa ‘Pyydä palautetta’ -painiketta ja organisaatiosi tukihenkilöt saavat ilmoituksen pyynnöstäsi sähköpostiinsa. Heidän kommenttinsa näkyvät ‘kommentti’kentässä eri kysymysten kohdalla. Saat sähköposti-ilmoituksen, kun tukihenkilö on antanut palautetta.

source: Download plans
fi: Tulosta suunnitelmia

source: From here you can download your plan in various formats. This may be useful if you need to submit your plan as part of a grant application. Choose what format you would like to view/download your plan in and click to download. You can also adjust the formatting (font type, size and margins) for PDF files, which may be helpful if working to page limits.
fi: Tästä voit ladata suunnitelmasi eri muodoissa. Tämä voi olla hyödyllistä, jos sinun on lähetettävä suunnitelma osana avustushakemusta. Valitse missä muodossa haluat tarkastella / ladata suunnitelmaasi ja napsauttaa lataamista. Voit myös säätää PDF-tiedostojen muotoilua (fonttityyppiä, kokoa ja marginaaleja), mikä voi olla hyödyllistä, jos työskentelet sivujen rajoihin.

source: Useful resources on Data Management Planning
fi: Hyödyllisiä resursseja tiedonhallinnan suunnittelussa

source: UK funder requirements for Data Management Plans
fi: Yhdistyneen kuningaskunnan rahoittajien vaatimukset tietohallintosuunnitelmille

source: [webpage]
fi: [Nettisivu]

source: Downloadable templates based on the requirements of UK Research Councils and other charitable or health funders.
fi: Ladattavat mallit, jotka perustuvat Yhdistyneen kuningaskunnan tutkimusneuvoston ja muiden hyväntekeväisyys- tai terveydenhuollon rahoittajien vaatimuksiin.

source: US funder requirements for Data Management Plans
fi: Yhdysvaltain rahoittajien vaatimukset tietohallintosuunnitelmille

source: A summary of requirements from the NSF, NIH and other key funders in the USA.
fi: Yhteenveto NSF: n, NIH: n ja muiden tärkeiden rahoittajien vaatimuksista Yhdysvalloissa.

source: DCC Checklist for a Data Management Plan
fi: DCC tarkistuslista tietohallintosuunnitelmaan

source: [PDF, 3 pages]
fi: [PDF, 3 sivua]

source: A list of 13 questions and associated guidance, that represent the main issues to come up in Data Management and Sharing Plans. The Checklist is used as a generic template in DMPTuuli, and is presented when no funder or organsiational requirements are applicable for the user.
fi: Luettelo 13 kysymyksestä ja siihen liittyvästä ohjauksesta, jotka edustavat tärkeimpiä kysymyksiä, jotka tulevat esiin tietojenkäsittely- ja jakamissuunnitelmissa. Tarkistuslista käytetään DMPTuulissa yleisenä mallina, ja se esitetään, kun käyttäjälle ei ole sovellettu rahoittajaa tai organisatorisia vaatimuksia.

source: How to develop a Data Management and Sharing Plan
fi: Tietojenkäsittely- ja jakamissuunnitelman kehittäminen

source: [PDF, 8 pages]
fi: [PDF, 8 sivua]

source: A guide by the Digital Curation Centre that outlines typical funder requirements for DMPs and the types of considerations to make when responding.
fi: Digital Curation Centerin opas, jossa kuvataan DMP: ien tyypillisiä rahoittajien vaatimuksia ja millaisia ​​näkökulmia vastauksena on.

source: Example Data Management Plans
fi: Esimerkki tietojenhallintasuunnitelmista

source: RIOjournal Data Management Plan collection
fi: RIOjournal Tietojenhallintasuunnitelman kokoelma

source: A selection of DMPs published in the Research Information and Outcomes journal.
fi: Valikoima DMP-julkaisuja, jotka julkaistaan ​​tutkimustietoutta ja -julkaisuissa.

source: Technical plan submitted to the AHRC
fi: AHRC: lle toimitettu tekninen suunnitelma

source: [PDF, 7 pages]
fi: [PDF, 7 sivua]

source: A DMP submitted by a researcher from the University of Bristol, also including comments from the reviewers.
fi: DMP: n toimittaja Bristolin yliopiston tutkijasta, mukaan lukien arvostelijoiden kommentit.

source: Two social science DMPs
fi: Kaksi yhteiskuntatieteellistä DMP: tä

source: Example plans from researchers at the University of Leeds, shared as part of the Leeds RoaDMaP training materials.
fi: Esimerkkejä Leedsin yliopiston tutkijoiden suunnitelmista, jotka on jaettu osana Leeds RoaDMaP -koulutusmateriaalia.

source: Colorado School of Mines examples
fi: Colorado School of Mines esimerkkejä

source: A variety of US example DMPs from Mines and elsewhere.
fi: Erilaisia ​​Yhdysvaltojen esimerkkejä DMP: stä kaivoksista ja muualta.

source: NSF data management plans
fi: NSF: n tietojenhallintasuunnitelmat

source: 5 DMPs submitted to the NSF, shared by the DataOne initiative.
fi: 5 DMP: tä toimitettiin NSF: lle, jota DataOne-aloite jakaa.

source: Further examples are available on the
fi: Muita esimerkkejä on saatavilla

source: DCC website
fi: DCC: n verkkosivuilla

source: Useful guides on Research Data Management in general
fi: Hyödyllisiä oppaita tutkimustiedonhallinnasta yleensä

source: Research Data MANTRA
fi: Tutkimustiedot MANTRA

source: [online resource]
fi: [verkkoaineisto]

source: An online training course designed for researchers or others planning to manage digital data as part of the research process. The course includes a number of software practicals on using SPSS, R, ArcGIS and NVivo.
fi: Verkko-opetus, joka on suunniteltu tutkijoille tai muille, jotka suunnittelevat digitaalisen tiedon hallintaa osana tutkimusprosessia. Kurssi sisältää useita ohjelmistokäytäntöjä SPSS, R, ArcGIS ja NVivo -ohjelmien käyttämisessä.

source: Managing and Sharing Data: best practice for researchers
fi: Tiedon hallinta ja jakaminen: tutkijoiden parhaat käytännöt

source: [PDF, 36 pages]
fi: [PDF, 36 sivua]

source: A guide by the UK Data Service covering a range of topics including data formats, documentaion, ethics, copyright and data sharing.
fi: Yhdistyneen kuningaskunnan tietopalvelun opas, joka kattaa useita aiheita, mukaan lukien tietomuodot, dokumentaatio, etiikka, tekijänoikeudet ja tietojen jakaminen.

source: How to Cite Datasets and Link to Publications
fi: Kuinka mainita tietokentät ja linkki julkaisuihin

source: [PDF, 12 pages]
fi: [PDF, 12 sivua]

source: A guide by the Digital Curation Centre giving practical guidelines on how to cite data and the different tools and infrastructure that can be used to support data citation.
fi: Digital Curation Centerin opas, jossa annetaan käytännön ohjeita siitä, miten mainita tietoja ja erilaisia ​​työkaluja ja infrastruktuureja, joita voidaan käyttää datatietojen tukemiseen.

source: How to License Research Data
fi: Kuinka lisenssien tutkimustiedot

source: [PDF, 16 pages]
fi: [PDF, 16 sivua]

source: A guide by the Digital Curation Centre that outlines different types of licenses, the pros and cons of each and how they can be applied.
fi: Digital Curation Centerin opas, jossa esitetään eri tyyppiset käyttöoikeudet, kunkin edut ja haitat sekä niiden soveltaminen.

source: How to Appraise and Select Research Data for Curation
fi: Miten arvioida ja valita tutkimustiedot kurimuksi

source: A guide by ANDS and the Digital Curation Centre on how to select which data to keep for long-term preservation, sharing and reuse. The guide puts forward several criteria to aid selection decisions.
fi: ANDS: n ja Digital Curation Centerin opas siitä, kuinka valita pitkän aikavälin säilyttämiseen, jakamiseen ja uudelleenkäyttöön tulevat tiedot. Opas esittää useita kriteerejä valintapäätösten tukemiseksi.

source: Controller
fi: ohjain

source: Helsinki University Library
fi: Helsingin yliopiston kirjasto

source: FI-00014 University of Helsinki
fi: 00014 Helsingin yliopisto

source: Tel: +358 (0) 2941 911
fi: Puh: +358 (0) 2941 911

source: Digital Curation Centre
fi: Digital Curation Center

source: Old College, South Bridge
fi: Vanha College, South Bridge

source: Tel: +44 (0) 131 651 1239
fi: Puh: +44 (0) 131 651 1239

source: Contact point
fi: Yhteyspiste

source: Tuuli Office,
fi: Tuuli-toimisto,

source: Name of the register
fi: Rekisterin nimi

source: %{application_name} ('the tool', 'the system') is a tool developed by the Digital Curation Centre, University of Edinburgh, UK and California Digital Library as a shared resource for the research community. It is hosted at the University of Edinburgh by the DCC. The Tool is maintained as separate instance and tailored for Finnish research organisations by Tuuli Office. The data is stored at servers of EDINA, University of Edinburgh, UK.
fi: %{application_name} ('työkalu', 'järjestelmä') on Digital Curation Centerin, Edinburghin yliopiston, Yhdistyneen kuningaskunnan ja Kalifornian digitaalisen kirjaston kehittämä työkalu tutkimusyhteisön yhteisenä resurssina. Se on isäntänä DCC: n yliopistossa Edinburghissa. Työkalu pidetään erikseen ja Tuuli-toimisto räätälöi suomalaisille tutkimusorganisaatioille. Tiedot tallennetaan EDINA-palvelimille, Edinburghin yliopisto, Iso-Britannia.

source: Purpose for processing the personal data
fi: Tarkoitus henkilötietojen käsittelyssä

source: The register is developed to manage information about users and data management plans created by users. The information about the users is needed to manage user accounts and give access to the %{application_name} tool. The University of Edinburgh holds plans created by users on user's behalf, but they are user's property and responsibility.
fi: Rekisteriä kehitetään hallitsemaan käyttäjien tietoja ja käyttäjien luomaa tietohallintasuunnitelmaa. Käyttäjien tietoja tarvitaan hallitsemaan käyttäjätilejä ja antamaan pääsyn %{application_name} -työkaluun. Edinburghin yliopisto pitää sisällään käyttäjille luomat suunnitelmat käyttäjän puolesta, mutta ne ovat käyttäjän omaisuutta ja vastuuta.

source: In order to help identify and administer your account with %{application_name}, we need to store your name and email address. We may also use it to contact you to obtain feedback on your use of the tool, or to inform you of the latest developments or releases.
fi: Jotta voit tunnistaa ja hallinnoida tilisi %{application_name}: lla, sinun on tallennettava nimi ja sähköpostiosoite. Voimme myös käyttää sitä ottamaan yhteyttä sinuun saadaksesi palautetta työkalun käytöstä tai ilmoittamaan sinulle viimeisimmistä kehityksistä tai julkaisuista.
